package org.example.HomeworkJAVA2;

public class Concatenation {
    //     1 уровень сложности: Задание 1
//    Создайте класс Concatenation
//    Создайте две переменные типа String
//    Примените конкатенацию строк и выведите результат в консоль.
//    Скомпилируйте созданную программу.
//    Запустите программу в терминале.

    public static void main(String[] args) {
        String first = "Hello";
        String second = "World";
        System.out.println(first + " " + second);
    }
}
