package org.example.HomeworkJAVA2;

public class Main {
//     1 уровень сложности: Задание 1
//    Создайте класс Concatenation
//    Создайте две переменные типа String
//    Примените конкатенацию строк и выведите результат в консоль.
//    Скомпилируйте созданную программу.
//    Запустите программу в терминале.
//
//    Задание 2
//    Создайте класс Converter - конвертер системы счисления.
//    У пользователя спрашивается число системы счисления, (используйте Scanner)
//    Запрашивается само число (ожидается корректный ввод)
//    У пользователя спрашивается число системы счисления в какую перевести
//    Конвертация должна быть с помощью класса обертки Long.
//
//
//    Дополнительное задание.
//    Напишите программу, которая вычисляет, сколько лишних калорий будет, если вместо пиццы диаметром 24 см вы купите пиццу диаметром 28 см.
//    Чтобы решить эту проблему, предположим, что каждый квадратный сантиметр пиццы содержит 40 калорий.
}
